#ifndef __LCD16032_H
#define __LCD16032_H
/**********************************************************************************************************
*文件名：eeprom.c
*所在路径：Hardware/lcd16032/lcd16032.h
*创建时间: 2012-08-011
*功能描述: 放置LM16032液晶屏驱动函数头文件
*作   者 ： 农晓明
*公   司 ： 光隆金宇
**********************************************************************************************************/
#include "LPC177x_8x.h"


/**********************************************************************************************************
*硬件管脚连接如下：
* LCD_RS ---P2.8
* LCD_RW ---P2.9
* LCD_E  ---P2.11
* LCD_B  ---P2.12
* LCD_DB[0..7] ---P2[0..7]
***********************************************************************************************************/
#define LCD_PORT_INIT  LPC_GPIO0->DIR |=(3<<8);LPC_GPIO2->DIR |= 0X3FF

#define BLCD_ON    LPC_GPIO0->CLR|=(1<<8)         //LCD背光开
#define BLCD_OFF   LPC_GPIO0->SET|=(1<<8)         //LCD背光关

#define LCD_RS_SET LPC_GPIO0->SET|=(1<<9)
#define LCD_RS_CLR LPC_GPIO0->CLR|=(1<<9)

#define LCD_RW_SET LPC_GPIO2->SET|=(1<<0)
#define LCD_RW_CLR LPC_GPIO2->CLR|=(1<<0)

#define LCD_E_SET  LPC_GPIO2->SET|=(1<<1)
#define LCD_E_CLR  LPC_GPIO2->CLR|=(1<<1)

#define LCD_DATA(x) LPC_GPIO2->CLR|=(0XFF<<2);LPC_GPIO2->SET|=(x<<2)

/*************************************************************************************************************
*函数名称：LCD_WriteCmd()
*参   数 ：uint8_t cmd 写入的指令
*返回值  : void
*功能描述：LCD液晶屏写指令函数，外部调用
**************************************************************************************************************/
void LCD_WriteCmd(uint8_t cmd);
/*************************************************************************************************************
*函数名称：LCD_WriteData()
*参   数 ：uint8_t dat   写入的数据
*返回值  : void
*功能描述：LCD液晶屏写数据函数，外部调用
**************************************************************************************************************/
void LCD_WriteData(uint8_t dat);
/*************************************************************************************************************
*函数名称：LCD_Init()
*参   数 ：void
*返回值  : void
*功能描述：LCD液晶屏GPIO初始化配置函数，内部调用
**************************************************************************************************************/
void LCD_Init(void);
/*************************************************************************************************************
*函数名称：LCD_SetCursor()
*参   数 ：uint8_t X,uingt8_t Y   //相对于屏幕显示的XY值
*返回值  : void
*功能描述：LCD液晶屏设置光标位置函数函数，内部调用
**************************************************************************************************************/
void LCD_SetCursor(uint8_t X,uint8_t Y);
/*************************************************************************************************************
*函数名称：LCD_PutChar()
*参   数 ：uint8_t CharY,uint8_t CharX,uint8_t *ASC_GB  //相对于屏幕显示的XY值
*返回值  : void
*功能描述：LCD液晶屏指定位置输出字符函数，外部调用
**************************************************************************************************************/
void LCD_PutStr(uint8_t CharY,uint8_t CharX,uint8_t *ASC_GB);

/*************************************************************************************************************
*函数名称：LCD_Putline()
*参   数 ：uint8_t CharY,uint8_t CharX,uint8_t *ASC_GB  //相对于屏幕显示的XY值
*返回值  : void
*功能描述：LCD液晶屏指定位置输出一个行(20个字节)字符函数，外部调用
**************************************************************************************************************/
void LCD_Putline(uint8_t CharY,uint8_t CharX, uint8_t *ASC_GB);

#endif  /*结束_LCD16032_H*/
